In [113]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
%matplotlib inline

In [114]:
unemp_county = pd.read_csv('/home/moritz/Desktop/kaggle/unemployment-by-county-us/output.csv')
unemp_county.head()

   Year     Month        State         County  Rate
0  2015  February  Mississippi  Newton County   6.1
1  2015  February  Mississippi  Panola County   9.4
2  2015  February  Mississippi  Monroe County   7.9
3  2015  February  Mississippi   Hinds County   6.1
4  2015  February  Mississippi  Kemper County  10.6

In [115]:
df = pd.read_csv('/home/moritz/Desktop/minwagedata.csv')
df.head()

,Unnamed: 0,Year,State,Table_Data,Footnote,High.Value,Low.Value,CPI.Average,High.2018,Low.2018
0,0,1968,Alabama,...,NaN,0.00000,0.00000,34.783333,0.00,0.00
1,1,1968,Alaska,2.10,NaN,2.10000,2.10000,34.783333,15.12,15.12
2,2,1968,Arizona,18.72 - 26.40/wk(b),(b),0.66000,0.46800,34.783333,4.75,3.37
3,3,1968,Arkansas,1.25/day(b),(b),0.15625,0.15625,34.783333,1.12,1.12
4,4,1968,California,1.65(b),(b),1.65000,1.65000,34.783333,11.88,11.88

In [116]:
act_min_wage = pd.DataFrame()
for name, group in df.groupby('State'):
    if act_min_wage.empty:
        act_min_wage=group.set_index('Year')[['Low.2018']].rename(columns={'Low.2018':name})
    else:
        act_min_wage=act_min_wage.join(group.set_index('Year')[['Low.2018']].rename(columns={'Low.2018':name}))


print(act_min_wage.tail())

      Alabama  Alaska  Arizona  Arkansas  California  Colorado  Connecticut  \
Year
2013      0.0    8.33     8.38      6.72        8.60      8.36         8.87
2014      0.0    8.20     8.36      6.61        9.52      8.46         9.20
2015      0.0    9.24     8.50      7.92        9.51      8.69         9.67
2016      0.0   10.17     8.40      8.35       10.43      8.67        10.02
2017      0.0   10.01    10.22      8.68       10.22      9.50        10.32

      Delaware  District of Columbia  Federal (FLSA)  ...  Tennessee  Texas  \
Year                                                  ...
2013      7.79                  8.87            7.79  ...        0.0   7.79
2014      8.20                 10.05            7.67  ...        0.0   7.67
2015      8.72                 11.09            7.66  ...        0.0   7.66
2016      8.61                 12.00            7.56  ...        0.0   7.56
2017      8.43                 11.75            7.41  ...        0.0   7.41

      U.S. Virgin Islands  Utah  Vermont  Virginia  Washington  West Virginia  \
Year
2013                 4.62  7.79     9.24      7.79        9.88           7.79
2014                 4.55  7.67     9.23      7.67        9.86           7.67
2015                 4.54  7.66     9.67      7.66       10.00           8.45
2016                 4.49  7.56    10.02      7.56        9.88           9.13
2017                 4.39  7.41    10.22      7.41       11.24           8.94

      Wisconsin  Wyoming
Year
2013       7.79     5.54
2014       7.67     5.45
2015       7.66     5.44
2016       7.56     5.37
2017       7.41     5.26

[5 rows x 55 columns]

In [117]:
act_min_wage=act_min_wage.replace(0, np.NaN).dropna(axis=1)
print(act_min_wage.tail())

      Alaska  Arkansas  California  Colorado  Connecticut  Delaware  \
Year
2013    8.33      6.72        8.60      8.36         8.87      7.79
2014    8.20      6.61        9.52      8.46         9.20      8.20
2015    9.24      7.92        9.51      8.69         9.67      8.72
2016   10.17      8.35       10.43      8.67        10.02      8.61
2017   10.01      8.68       10.22      9.50        10.32      8.43

      District of Columbia  Federal (FLSA)  Guam  Hawaii  ...  Pennsylvania  \
Year                                                      ...
2013                  8.87            7.79  7.79    7.79  ...          7.79
2014                 10.05            7.67  7.67    7.67  ...          7.67
2015                 11.09            7.66  8.72    8.19  ...          7.66
2016                 12.00            7.56  8.61    8.87  ...          7.56
2017                 11.75            7.41  8.43    9.45  ...          7.41

      Puerto Rico  Rhode Island  South Dakota  Utah  Vermont  Washington  \
Year
2013         5.46          8.33          7.79  7.79     9.24        9.88
2014         5.37          8.46          7.67  7.67     9.23        9.86
2015         5.37          9.51          8.98  7.66     9.67       10.00
2016         5.30         10.02          8.92  7.56    10.02        9.88
2017         5.19          9.81          8.84  7.41    10.22       11.24

      West Virginia  Wisconsin  Wyoming
Year
2013           7.79       7.79     5.54
2014           7.67       7.67     5.45
2015           8.45       7.66     5.44
2016           9.13       7.56     5.37
2017           8.94       7.41     5.26

[5 rows x 39 columns]

In [118]:
def get_min_wage(year, state):
  try:
    return act_min_wage.loc[year][state]
  except:
    return np.NaN


get_min_wage(2017,'Alaska')

10.01

In [119]:
%%time

unemp_county['min_wage'] = list(map(get_min_wage, unemp_county['Year'], unemp_county['State']))

CPU times: user 1min 48s, sys: 0 ns, total: 1min 48s
Wall time: 1min 48s

In [120]:
unemp_county

        Year     Month        State              County  Rate  min_wage
0       2015  February  Mississippi       Newton County   6.1       NaN
1       2015  February  Mississippi       Panola County   9.4       NaN
2       2015  February  Mississippi       Monroe County   7.9       NaN
3       2015  February  Mississippi        Hinds County   6.1       NaN
4       2015  February  Mississippi       Kemper County  10.6       NaN
...      ...       ...          ...                 ...   ...       ...
885543  2009  November        Maine     Somerset County  10.5      8.46
885544  2009  November        Maine       Oxford County  10.5      8.46
885545  2009  November        Maine         Knox County   7.5      8.46
885546  2009  November        Maine  Piscataquis County  11.3      8.46
885547  2009  November        Maine    Aroostook County   9.0      8.46

[885548 rows x 6 columns]

In [121]:
unemp_county[['Rate','min_wage']].corr()

              Rate  min_wage
Rate      1.000000  0.153047
min_wage  0.153047  1.000000

In [122]:
unemp_county[['Rate','min_wage']].cov()

              Rate  min_wage
Rate      9.687873  0.651586
min_wage  0.651586  1.874228

In [123]:
pres16 = pd.read_csv('/home/moritz/Desktop/kaggle/2016uspresidentialvotebycounty/pres16results.csv')
print(pres16.head())

  county fips             cand  st  pct_report       votes  total_votes  \
0    NaN   US     Donald Trump  US      0.9951  60350241.0  127592176.0
1    NaN   US  Hillary Clinton  US      0.9951  60981118.0  127592176.0
2    NaN   US     Gary Johnson  US      0.9951   4164589.0  127592176.0
3    NaN   US       Jill Stein  US      0.9951   1255968.0  127592176.0
4    NaN   US    Evan McMullin  US      0.9951    451636.0  127592176.0

        pct          lead
0  0.472993  Donald Trump
1  0.477938  Donald Trump
2  0.032640  Donald Trump
3  0.009844  Donald Trump
4  0.003540  Donald Trump

In [124]:
len(unemp_county)

885548

In [125]:
# df.loc[df['column_name'] == some_value]
new_unemp_county=unemp_county.copy()[(unemp_county['Year']==2015) & (unemp_county['Month']=='February')]

In [126]:
new_unemp_county

      Year     Month        State              County  Rate  min_wage
0     2015  February  Mississippi       Newton County   6.1       NaN
1     2015  February  Mississippi       Panola County   9.4       NaN
2     2015  February  Mississippi       Monroe County   7.9       NaN
3     2015  February  Mississippi        Hinds County   6.1       NaN
4     2015  February  Mississippi       Kemper County  10.6       NaN
...    ...       ...          ...                 ...   ...       ...
2797  2015  February        Maine     Somerset County   8.4      7.92
2798  2015  February        Maine       Oxford County   6.8      7.92
2799  2015  February        Maine         Knox County   6.1      7.92
2800  2015  February        Maine  Piscataquis County   7.0      7.92
2801  2015  February        Maine    Aroostook County   7.2      7.92

[2802 rows x 6 columns]

In [127]:
pres16['st'].unique()

array(['US', 'CA', 'FL', 'TX', 'NY', 'PA', 'IL', 'OH', 'MI', 'NC', 'GA',
       'VA', 'NJ', 'MA', 'WI', 'MN', 'MO', 'WA', 'IN', 'CO', 'TN', 'MD',
       'SC', 'AL', 'AZ', 'LA', 'KY', 'OR', 'CT', 'IA', 'OK', 'MS', 'KS',
       'NV', 'AR', 'UT', 'NE', 'NM', 'ME', 'NH', 'WV', 'ID', 'MT', 'RI',
       'DE', 'HI', 'SD', 'ND', 'VT', 'DC', 'WY', 'AK', nan], dtype=object)

In [128]:
len(pres16['st'].unique())

53

In [129]:
import requests
import lxml
web=requests.get('https://www.infoplease.com/us/postal-information/state-abbreviations-and-state-postal-codes')
dfs=pd.read_html(web.text)

In [130]:
print(dfs)

[          State/District Abbreviation Postal Code
0                Alabama         Ala.          AL
1                 Alaska       Alaska          AK
2                Arizona        Ariz.          AZ
3               Arkansas         Ark.          AR
4             California       Calif.          CA
5               Colorado        Colo.          CO
6            Connecticut        Conn.          CT
7               Delaware         Del.          DE
8   District of Columbia         D.C.          DC
9                Florida         Fla.          FL
10               Georgia          Ga.          GA
11                Hawaii       Hawaii          HI
12                 Idaho        Idaho          ID
13              Illinois         Ill.          IL
14               Indiana         Ind.          IN
15                  Iowa         Iowa          IA
16                Kansas        Kans.          KS
17              Kentucky          Ky.          KY
18             Louisiana          La.          LA
19                 Maine        Maine          ME
20              Maryland          Md.          MD
21         Massachusetts        Mass.          MA
22              Michigan        Mich.          MI
23             Minnesota        Minn.          MN
24           Mississippi        Miss.          MS
25              Missouri          Mo.          MO
26               Montana        Mont.          MT
27              Nebraska        Nebr.          NE
28                Nevada         Nev.          NV
29         New Hampshire         N.H.          NH
30            New Jersey         N.J.          NJ
31            New Mexico         N.M.          NM
32              New York         N.Y.          NY
33        North Carolina         N.C.          NC
34          North Dakota         N.D.          ND
35                  Ohio         Ohio          OH
36              Oklahoma        Okla.          OK
37                Oregon         Ore.          OR
38          Pennsylvania          Pa.          PA
39          Rhode Island         R.I.          RI
40        South Carolina         S.C.          SC
41          South Dakota         S.D.          SD
42             Tennessee        Tenn.          TN
43                 Texas         Tex.          TX
44                  Utah         Utah          UT
45               Vermont          Vt.          VT
46              Virginia          Va.          VA
47            Washington        Wash.          WA
48         West Virginia        W.Va.          WV
49             Wisconsin         Wis.          WI
50               Wyoming         Wyo.          WY,   Territory/Associate Abbreviation Postal Code
0      American Samoa          NaN          AS
1                Guam         Guam          GU
2    Marshall Islands          NaN          MH
3          Micronesia          NaN          FM
4   Northern Marianas          NaN          MP
5               Palau          NaN          PW
6         Puerto Rico         P.R.          PR
7      Virgin Islands          NaN          VI]

In [131]:
state_abbv = dfs[0]

In [132]:
print(type(state_abbv))

<class 'pandas.core.frame.DataFrame'>

In [133]:
state_abbv.to_csv('state_abbv', index=False)

In [134]:
state_abbv=pd.read_csv('state_abbv',index_col=0)
state_abbv=state_abbv[['Postal Code']]
state_abbv.head()

               Postal Code
State/District
Alabama                 AL
Alaska                  AK
Arizona                 AZ
Arkansas                AR
California              CA

In [135]:
state_abbv_dict=state_abbv.to_dict()['Postal Code']
state_abbv_dict

{'Alabama': 'AL',
 'Alaska': 'AK',
 'Arizona': 'AZ',
 'Arkansas': 'AR',
 'California': 'CA',
 'Colorado': 'CO',
 'Connecticut': 'CT',
 'Delaware': 'DE',
 'District of Columbia': 'DC',
 'Florida': 'FL',
 'Georgia': 'GA',
 'Hawaii': 'HI',
 'Idaho': 'ID',
 'Illinois': 'IL',
 'Indiana': 'IN',
 'Iowa': 'IA',
 'Kansas': 'KS',
 'Kentucky': 'KY',
 'Louisiana': 'LA',
 'Maine': 'ME',
 'Maryland': 'MD',
 'Massachusetts': 'MA',
 'Michigan': 'MI',
 'Minnesota': 'MN',
 'Mississippi': 'MS',
 'Missouri': 'MO',
 'Montana': 'MT',
 'Nebraska': 'NE',
 'Nevada': 'NV',
 'New Hampshire': 'NH',
 'New Jersey': 'NJ',
 'New Mexico': 'NM',
 'New York': 'NY',
 'North Carolina': 'NC',
 'North Dakota': 'ND',
 'Ohio': 'OH',
 'Oklahoma': 'OK',
 'Oregon': 'OR',
 'Pennsylvania': 'PA',
 'Rhode Island': 'RI',
 'South Carolina': 'SC',
 'South Dakota': 'SD',
 'Tennessee': 'TN',
 'Texas': 'TX',
 'Utah': 'UT',
 'Vermont': 'VT',
 'Virginia': 'VA',
 'Washington': 'WA',
 'West Virginia': 'WV',
 'Wisconsin': 'WI',
 'Wyoming': 'WY'}

In [136]:
# pandas.Series.map is used
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.map.html#pandas-series-map

new_unemp_county['State']=new_unemp_county['State'].map(state_abbv_dict)

In [137]:
new_unemp_county.head()

   Year     Month State         County  Rate  min_wage
0  2015  February    MS  Newton County   6.1       NaN
1  2015  February    MS  Panola County   9.4       NaN
2  2015  February    MS  Monroe County   7.9       NaN
3  2015  February    MS   Hinds County   6.1       NaN
4  2015  February    MS  Kemper County  10.6       NaN

In [138]:
new_unemp_county.tail()

      Year     Month State              County  Rate  min_wage
2797  2015  February    ME     Somerset County   8.4      7.92
2798  2015  February    ME       Oxford County   6.8      7.92
2799  2015  February    ME         Knox County   6.1      7.92
2800  2015  February    ME  Piscataquis County   7.0      7.92
2801  2015  February    ME    Aroostook County   7.2      7.92

In [139]:
print(len(pres16))
print(len(new_unemp_county))

18475
2802

In [140]:
pres16.columns

Index(['county', 'fips', 'cand', 'st', 'pct_report', 'votes', 'total_votes',
       'pct', 'lead'],
      dtype='object')

In [141]:
new_unemp_county.columns

Index(['Year', 'Month', 'State', 'County', 'Rate', 'min_wage'], dtype='object')

In [142]:
pres16.rename(columns={'county':'County', 'st':'State'},inplace=True)

In [143]:
for df in [new_unemp_county, pres16]:
    df.set_index(['County', 'State'], inplace=True)

In [144]:
pres16.head()

             fips             cand  pct_report       votes  total_votes  \
County State
NaN    US      US     Donald Trump      0.9951  60350241.0  127592176.0
       US      US  Hillary Clinton      0.9951  60981118.0  127592176.0
       US      US     Gary Johnson      0.9951   4164589.0  127592176.0
       US      US       Jill Stein      0.9951   1255968.0  127592176.0
       US      US    Evan McMullin      0.9951    451636.0  127592176.0

                   pct          lead
County State
NaN    US     0.472993  Donald Trump
       US     0.477938  Donald Trump
       US     0.032640  Donald Trump
       US     0.009844  Donald Trump
       US     0.003540  Donald Trump

In [145]:
pres16=pres16[pres16['cand']=='Donald Trump']
pres16=pres16[['pct']]
pres16.dropna(inplace=True)

In [146]:
pres16.tail()

                          pct
County        State
Clark County  ID     0.717314
Arthur County NE     0.901141
Kenedy County TX     0.451613
King County   TX     0.937107
Loving County TX     0.890625

In [147]:
pres16.head()

                   pct
County State
NaN    US     0.472993
       CA     0.330641
       FL     0.490640
       TX     0.525830
       NY     0.374752

In [148]:
all_together = new_unemp_county.merge(pres16, on=['County', 'State'])
all_together.dropna(inplace=True)

In [149]:
all_together.tail()

                          Year     Month  Rate  min_wage       pct
County             State
Somerset County    ME     2015  February   8.4      7.92  0.577557
Oxford County      ME     2015  February   6.8      7.92  0.521451
Knox County        ME     2015  February   6.1      7.92  0.397376
Piscataquis County ME     2015  February   7.0      7.92  0.590879
Aroostook County   ME     2015  February   7.2      7.92  0.555416

In [150]:
all_together.drop(['Year','Month'],axis=1,inplace=True)

In [151]:
all_together.head()

                           Rate  min_wage       pct
County              State
Major County        OK      2.6      2.11  0.864960
Pottawatomie County OK      4.5      2.11  0.701342
Johnston County     OK      6.5      2.11  0.770057
Jefferson County    OK      5.0      2.11  0.812367
Beaver County       OK      2.8      2.11  0.888243

In [152]:
all_together.tail()

                          Rate  min_wage       pct
County             State
Somerset County    ME      8.4      7.92  0.577557
Oxford County      ME      6.8      7.92  0.521451
Knox County        ME      6.1      7.92  0.397376
Piscataquis County ME      7.0      7.92  0.590879
Aroostook County   ME      7.2      7.92  0.555416

In [153]:
all_together.corr()

              Rate  min_wage       pct
Rate      1.000000  0.186689 -0.085985
min_wage  0.186689  1.000000 -0.325036
pct      -0.085985 -0.325036  1.000000

In [154]:
all_together.cov()

              Rate  min_wage       pct
Rate      5.743199  0.683870 -0.031771
min_wage  0.683870  2.336451 -0.076602
pct      -0.031771 -0.076602  0.023772